Repository: kalyx/nuclia-search-for-wp
Catalog: languages/klx-nuclia-search-for-wp-*.po
Languages: fr_fr

source: Settings
fr_fr: Réglages

source: Knowledge Box ID
fr_fr: ID de votre boîte de connaissances

source: Post types to index
fr_fr: Types de contenu à indexer

source: Your Nuclia Zone. Default: europe-1
fr_fr: Votre zone Nuclia. Par défaut: europe-1

source: Your Nuclia Service Access token with Contributor access (kept private).
fr_fr: Votre jeton d'accès à l'API Nuclia avec accès Contributeur.

source: Your Nuclia Knowledge box UID (must be public).
fr_fr: UID de votre boîte de connaissances ( doit être publique )

source: You can start indexing your site.
fr_fr: Vous pouvez commencer à indexer votre site.

source: Zone should not be empty.
fr_fr: Le champ zone doit être renseigné.

source: Service Access token should not be empty.
fr_fr: Le champ token doit être renseigné.

source: Knowledge box UID should not be empty.
fr_fr: Le champ ID de votre boîte de connaissances doit être renseigné.

source: We were unable to authenticate you against the Nuclia servers with the provided information. Please ensure that you used a valid Zone and Knowledge Box ID.
fr_fr: Nous n'avons pas pu vous authentifier auprès des serveurs Nuclia avec les informations fournies. Veuillez vous assurer que vous avez utilisé un identifiant de zone et de boîte de connaissances valide.

source: It looks like your token is wrong.
fr_fr: Il semble que votre token ne soit pas correct.

source: We succesfully managed to connect to the Nuclia servers with the provided information.
fr_fr: Nous avons réussi à nous connecter aux serveurs Nuclia avec les informations fournies.

source: No post type selected. No indexing will take place.
fr_fr: Aucun type de contenu sélectionné. Aucune indexation n'aura lieu.

source: Cannot connect to Nuclia API, please check your Knowledge Box ID.
fr_fr: Impossible de se connecter à l'API Nuclia, veuillez vérifier l'ID de votre boîte de connaissances.

source: Cannot connect to Nuclia API, no response from the server.
fr_fr: Impossible de se connecter à l'API Nuclia, pas de réponse du serveur.

source: The zone, token, knowledge base id can be found or configured at your Nuclia cloud account. Please sign up at %1s and sign in at %2s.
fr_fr: La zone, le jeton, l'id de la base de connaissances peuvent être trouvés ou configurés sur votre compte Nuclia cloud. Veuillez vous inscrire à %1s et vous connecter à %2s.

source: Once you provide your Nuclia Zone and API key, this plugin will be able to securely communicate with Nuclia servers.
fr_fr: Une fois que vous aurez fourni votre zone Nuclia et votre clé API, ce plugin pourra communiquer en toute sécurité avec les serveurs Nuclia.

source: We ensure your information is correct by testing them against the Nuclia servers upon save.
fr_fr: Nous nous assurons que vos informations sont correctes en les testant sur les serveurs Nuclia lors de leur sauvegarde.

source: You can put the Nuclia Searchbox widget in any widget area.
fr_fr: Vous pouvez placer le widget Nuclia Searchbox dans n'importe quelle zone de widget.

source: Shortcode
fr_fr: Code court

source: Copy and paste this shortcode into any content. For the features, you can choose:
fr_fr: Copiez et collez ce shortcode dans n'importe quel contenu. Pour les fonctionnalités, vous pouvez choisir :

source: clicking on a result will open the original page rather than rendering it in the viewer.
fr_fr: cliquer sur un résultat ouvrira la page d'origine plutôt que de l'afficher dans le visualiseur.

source: add extra parameters in URL allowing direct opening of a resource or search results.
fr_fr: ajoute des paramètres supplémentaires dans l'URL permettant l'ouverture directe d'une ressource ou des résultats de recherche.

source: suggest results while typing search query.
fr_fr: suggérer des résultats lors de la saisie d'une requête de recherche.

source: Your Nuclia credentials
fr_fr: Vos identifiants Nuclia

source: Fully functional and customizable widget to embed Nuclia's search in seconds.
fr_fr: Widget entièrement fonctionnel et personnalisable pour intégrer la recherche Nuclia en quelques secondes.

source: Nuclia shortcode misconfigured. Please provide your zone and your kbid.
fr_fr: Le shortcode Nuclia est mal configuré. Veuillez indiquer votre zone et votre kbid.

source: Navigate to links : clicking on a result will open the original page rather than rendering it in the viewer.
fr_fr: Naviguer vers les liens : cliquer sur un résultat ouvrira la page d'origine plutôt que de l'afficher dans le visualiseur.

source: Permalinks : add extra parameters in URL allowing direct opening of a resource or search results.
fr_fr: Permalines : ajoute des paramètres supplémentaires dans l'URL permettant l'ouverture directe d'une ressource ou des résultats de recherche.

source: Suggestions : suggest results while typing search query.
fr_fr: Suggestions : suggérer des résultats lors de la saisie d'une requête de recherche.

source: Title:
fr_fr: Titre :

source: Features:
fr_fr: Fonctionnalités :

source: Nuclia plugin requires PHP %1$s or higher. You’re still on %2$s.
fr_fr: Le plugin Nuclia nécessite PHP %1$s ou supérieur. Vous êtes toujours sur %2$s.

source: Nuclia plugin requires at least WordPress in version %1$s, You are on %2$s.
fr_fr: Le plugin Nuclia nécessite au moins WordPress en version %1$s, vous êtes sur %2$s.

source: Integrate the powerful Nuclia search service with WordPress
fr_fr: Intégrez le puissant service de recherche Nuclia à WordPress
